EDT/УТ/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛичногоТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.зпГруппыФизлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНетМонет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/ФизическиеЛица/Forms/ФормаСпискаУпр/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоЭкипажи", Параметры.Свойство("ТолькоЭкипажи"));
	
КонецПроцедуры

&НаСервере
Процедура УволенныеСотрудникиНаСервере()

	Элементы.ФормаУволенныеСотрудники.Пометка = Не Элементы.ФормаУволенныеСотрудники.Пометка;
	Если Элементы.ФормаУволенныеСотрудники.Пометка Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.Уволен);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УволенныеСотрудники(Команда)
	УволенныеСотрудникиНаСервере();
КонецПроцедуры
